[
  {"id": 2, "definition": "Des films caractérisés par une activité physique intense, comprenant des combats et des courses de voitures.", "style": "Action"},
  {"id": 22, "definition": "Des films destinés à un public adulte, souvent avec un contenu explicite.", "style": "Adult"},
  {"id": 7, "definition": "Des films qui impliquent des expériences excitantes et souvent dangereuses, généralement dans des endroits exotiques.", "style": "Adventure"},
  {"id": 13, "definition": "Des films qui utilisent des techniques d'animation pour créer l'illusion du mouvement.", "style": "Animation"},
  {"id": 3, "definition": "Des films qui dépeignent l'histoire de vie d'une personne réelle.", "style": "Biography"},
  {"id": 0, "definition": "Des films conçus pour amuser et divertir, souvent avec un contenu humoristique ou satirique.", "style": "Comedy"},
  {"id": 5, "definition": "Des films qui impliquent des activités criminelles, des enquêtes et des procédures légales.", "style": "Crime"},
  {"id": 19, "definition": "Des films non fictifs destinés à documenter la réalité ou à informer.", "style": "Documentary"},
  {"id": 1, "definition": "Des films axés sur une narration réaliste, sérieuse et émotionnelle.", "style": "Drama"},
  {"id": 14, "definition": "Des films adaptés à tous les groupes d'âge, souvent avec des thèmes adaptés aux enfants.", "style": "Family"},
  {"id": 9, "definition": "Des films qui impliquent des éléments magiques et fantastiques.", "style": "Fantasy"},
  {"id": 21, "definition": "Un style de réalisation cinématographique caractérisé par ses thèmes sombres, cyniques et un style visuel distinct.", "style": "Film-Noir"},
  {"id": 16, "definition": "Des films basés sur des événements, des figures ou des contextes historiques.", "style": "History"},
  {"id": 10, "definition": "Des films conçus pour susciter la peur, la terreur et le suspense grâce à des éléments surnaturels ou macabres.", "style": "Horror"},
  {"id": 15, "definition": "Des films centrés sur le monde de la musique et des musiciens.", "style": "Music"},
  {"id": 17, "definition": "Des films caractérisés par l'inclusion de numéros ou de séquences musicales.", "style": "Musical"},
  {"id": 11, "definition": "Des films qui impliquent du suspense, des secrets et la résolution d'un événement mystérieux.", "style": "Mystery"},
  {"id": 24, "definition": "Des productions cinématographiques liées à l'actualité, au journalisme ou aux documentaires.", "style": "News"},
  {"id": 12, "definition": "Des films axés sur les relations romantiques et les aspects émotionnels de l'amour.", "style": "Romance"},
  {"id": 8, "definition": "Les films de science-fiction explorent des concepts spéculatifs tels que la science et la technologie futures.", "style": "Sci-Fi"},
  {"id": 4, "definition": "Des films qui tournent autour du sport et de la compétition athlétique.", "style": "Sport"},
  {"id": 6, "definition": "Des films conçus pour susciter une excitation intense, du suspense et de l'anticipation.", "style": "Thriller"},
  {"id": 20, "definition": "Des films centrés autour de conflits armés et de thèmes militaires.", "style": "War"},
  {"id": 18, "definition": "Un genre de films se déroulant dans l'Ouest américain, mettant généralement en scène des cow-boys, des hors-la-loi et des Amérindiens.", "style": "Western"}
]